[
    {
        "id":1,
        "title": "I Wanna Dance with Somebody",
        "url":""
    },

2

“Take On Me” by A-ha

The first and biggest hit by the Norwegian electropop trio A-ha, “Take On Me,” rose to international popularity in 1985 on the strength of its groundbreaking video, a mix of live-action and pencil-drawn animation that starred dreamy lead singer Morten Harket as the hero of an escapist romance between a lonely woman and a comic-book adventurer. (It won six MTV Video Awards.) The song’s masterfully infectious synth riff, sampled back to glory by Pitbull and Christina Aguilera in 2013’s “Feel This Moment,” would be enough to secure it a spot on any list of ’80s classics. But “Take On Me” is also distinguished by Harket’s improbably octave-spanning vocals, whose seeming effortlessness has inspired countless screeching karaoke wipeouts.—Adam Feldman

Download on Amazon


ADVERTISING

3
“Don't Stop Believin'” by Journey
“Don't Stop Believin'” by Journey

By this point, you know where you stand on this one: You hear Jonathan Cain's piano intro, and you either swell up with joy or wince in pain. Whatever your take, you're about to get flattened by an emotional steamroller: four minutes of undiluted underdog yearning and a portrait of anonymous lost souls praying for luck and love on the streets of nonexistent South Detroit, starring Steve Perry's scarily, swoopingly elastic voice. Whether it's playing over the Sopranos finale, soundtracking a White Sox World Series run, turning up on Glee or simply blasting out of your earbuds at the gym, this song represents the apex of scream-along arena-scale pop-rock.—Hank Shteamer

Download on Amazon


4

“Modern Love” by David Bowie

Bowie was all over the place during the ’80s: duetting with Jagger, clambering into spandex for Labyrinth, getting buried alive for Merry Christmas, Mr. Lawrence and ultimately embarking on a midlife crisis that resulted in a worrying beard and Tin Machine. But before all that, he managed to lay down some of the decade’s best tracks, including this nihilistic, Nile Rodgers–assisted soul boogie from 1983. We defy your feet to stay on the floor as that cyclical, cynical, irresistible chorus hurtles on.—James Manning

Download on Amazon



The top 16 things to do in Lisbon and Porto

Whether you're coastal or in the mountains, you'll find endless things to do in Portugal's main cities

Paid content | Written by Time Out. Paid for by TAP Air Portugal
ADVERTISING

5

“Beat It” by Michael Jackson

We get so used to the sleek, funky side of Michael Jackson that it's easy to forget how hard "Beat It" actually legitimately rocks. And it's not just Eddie Van Halen's famous finger-busting solo; it's that perfectly formed sneer of a guitar riff—conceived by Jackson and played by session ace Steve Lukather—those exaggered downbeats that feel like medicine balls being slammed down on a concrete floor and the raw desperation in MJ's voice as he chronicles the harsh truths of the street-fighting life. As much of a dance-floor killer as it is, "Beat It" is a genuinely heavy song, psychologically as much as sonically.—Hank Shteamer

Download on Amazon


6
best 80s songs
“When Doves Cry” by Prince

As a cocksure teenager, Prince passed on four major-label record deals, demanding artistic autonomy until Warner Bros. granted it. Years later, he would infamously scrawl “slave” on his cheek, and emancipate himself from his given name, referring to himself by a proto-emoji. And yet, the sharp crack of a proverbial whip yielded some stunning results in 1984. The Purple Rain soundtrack was thought to be complete, but the director needed a power ballad to lay over a montage of domestic discord. Prince whipped up two tunes overnight, the winner being “When Doves Cry.” With such little time, he didn’t bother with a bassline. Debussy once noted, “Music is the space between notes.” Prince decked the emptiness with eyeliner and silk. It would be the pinnacle of his career. There’s something to be said for having a boss.—Brent DiCrescenzo

Download on Amazon

ADVERTISING

7

“Into the Groove” by Madonna

A song so quintessentially ’80s, from its sharp synth bass to its inclusion in her flick Desperately Seeking Susan—this popgasm has only one critic: Madonna. Years after its 1985 release, she said that she felt like a dork singing it. Fine, Madge, but you can't have looked as dorky as the millions of us who sang it into our hairbrushes.—Oliver Keens​

Download on Amazon


8
best 80s songs
“Blue Monday” by New Order

At nearly seven and a half minutes long, "Blue Monday" is one of the longest songs ever to show up on the U.K. singles chart. With its chugging synths and stuttering drum machine beat, it was a particularly visible signpost along New Order's journey from post-punk into dancier, italo-disco-inflected terrain. Considering "Blue Monday" went on to become the best-selling 12-inch single of all time, it's safe to say the band was headed in the right direction.—Kristen Zwicker

Download on Amazon


ADVERTISING

9
“Dancing in the Dark” by Bruce Springsteen
“Dancing in the Dark” by Bruce Springsteen

The Boss pinched the title of an old crooners’ standard to write his own classic, the finest single from his massive “Born in the USA” album in 1984. Bursting with ambition, frustration and sex, “Dancing in the Dark” is also Springsteen’s dance-floor peak, with a typically stunning sax solo by the late Clarence Clemons to top it all off. And there aren’t many songs from the era that come with an important warning about fire safety in the chorus.—James Manning

Download on Amazon


Recommended
Things To Do

The most gorgeous libraries in NYC
Things To Do

NYC events in April 2020
Things To Do

Best things to do in spring in NYC
Music

The best NYC concerts in March 2020
10

“Everybody Wants to Rule the World” by Tears for Fears

We may dismiss the '80s as an era of musical cheese, light on substance and heavy on excess (turn up the treble!, more sax!, etc.). But the decade delivered some of music’s most emotional, teary moments, the more affecting for the fact that the vehicle is pop. This 1985 hit by Tears for Fears is one such a song, an existential meditation of sorts, opening with the line, “Welcome to your life—there’s no turning back.” It’s a serious pop song, as bassist-singer Curt Smith remarked: “It's about everybody wanting power, about warfare and the misery it causes.”—Sophie Harris

Download on Amazon


11
“Private Eyes” by Hall & Oates
“Private Eyes” by Hall & Oates

In the early-’80s subgenre of songs about surveillance—a category that includes such worthies as “Eye in the Sky,” “Somebody’s Watching Me” and “Every Breath You Take”—none is as straight-up catchy as this mid-period Hall & Oates number, the title track of their 1981 album. The Philly duo was in the process of giving its rock-and-soul sound a shiny new-wave makeover (complete with synthesizer), but the secrets to the song’s lasting pep are its backing harmonies and, especially, its good old-fashioned handclaps. We dare you to hear it and not clap along.—Adam Feldman

Download on Amazon

12
“Livin' on a Prayer” by Bon Jovi
“Livin' on a Prayer” by Bon Jovi

For a good decade there, it seemed as though "Born to Run" was the absolute final word in blue-collar rock & roll mythmaking—but then along came the Boss's fellow Jerseyans Bon Jovi, who slathered the old story of two hard-luck dreamers longing for escape with a thick coat of glam-era bombast. Whether you take this 1986 hit as a cheesy relic or the apex of steroidal FM rawk, Bon Jovi's tale of guitarist turned dock worker Tommy and his diner-waitress main squeeze, Gina, is essentially flawless, right down to guitarist Richie Sambora's iconic talk-box–assisted opening hook and that vertigo-inducing key change after the bridge.—Hank Shteamer

Download on Amazon

ADVERTISING

13
"The Power of Love" by Huey Lewis & the News
“The Power of Love” by Huey Lewis & the News

It wasn't just a souped-up DeLorean that safely spirited Back to the Future's Marty McFly home to the '80s: He was also aided by this ditty from harmonica-blowing everydad Huey Lewis, who penned the song for the 1985 blockbuster's soundtrack. It's about as sappy as they come, but Baby Huey smartly slips in a line about how love doesn't require a credit card, which, as anyone who's gone on a date in the past 50 years can tell you, is totally bull. But it's a sweet thought.—Andrew Frisicano

Download on Amazon

14
"Don't You Want Me" by the Human League
“Don't You Want Me” by the Human League

1981 was the year that a band from Sheffield named after a sci-fi board game became pop superstars, and it was “Don’t You Want Me” that sealed the deal. But it almost didn’t. The Human League’s Phil Oakey tried to stop his “nasty song about sexual power politics” becoming the last single from the band’s era-defining Dare album. Virgin ended up releasing Oakey’s sordid but potent duet with the group’s teenage backing singer Susan Ann Sulley anyway. The rest is karaoke history, baby.—James Manning

Download on Amazon

ADVERTISING

15
“Once in a Lifetime” by Talking Heads
“Once in a Lifetime” by Talking Heads

Though it proved a surprise commercial hit for David Byrne's new-wave art-pop experimentalists, it's easy to forget just how deliciously weird this song sounded back in 1981. Serving up a heady—occasionally otherworldly—mixture of Afrobeat, funk, pop, rock, disco and psychedelia, the chorus of this existential anthem is huge enough to have stuck around for over 30 years.—Tristan Parker

Download on Amazon

16
The Jesus and Mary Chain - Psychocandy
“Just Like Honey” by The Jesus and Mary Chain

The first four iconic seconds of the Ronette's "Be My Baby" have been sampled again and again over the past 50 years: Billy Joel, The Magnetic Fields, The Strokes, Amy Winehouse, Dan Deacon, Gotye…the list goes on. But only one band had transformed that groundbreaking phrase into a musical piece that defined an era (almost) as deeply as the Ronettes. The Jesus and Mary Chain's "Just Like Honey" captures a certain proto-shoegazey, bittersweet longing that pristinely characterizes the hazy milieu of the ‘80s—not to mention gave Sophia Coppola's Lost In Translation a killer outro a few seconds before the credits roll.

Buy on Amazon

ADVERTISING

17
"Buffalo Stance" by Neneh Cherry
“Buffalo Stance” by Neneh Cherry

When she strode on the scene in 1988, Neneh Cherry was one of those pop stars who made you do a double take—what the? who the?—before you ran out of the house to buy the single (on cassette, natch). The stepdaughter of jazz musician Don Cherry, Neneh was raised in Stockholm, New York and London, which explains her deliciously odd accent and assured street smarts. Decades before a very pregnant MIA performed at the Grammys, Cherry made her British-TV debut performing this hip-hop classic pregnant and proud—and delivering one of hip-hop’s freshest flows to this day.—Sophie Harris

Download on Amazon

18
“All Night Long” by Lionel Richie
“All Night Long” by Lionel Richie

It's impossible to feel bad when this tune's Caribbean-inflected rhythms start pumping from a nearby speaker. The perma-coifed Commodores frontman's 1983 single smashes any attempts to resist its groove. And that bit that sounds like made-up gibberish? It is. Richie attempted to find some suitable foreign phrases but got impatient and invented his own international party language.—Andrew Frisicano

Download on Amazon

ADVERTISING

19
"Faith" by George Michael
“Faith” by George Michael

With jukeboxes and leather jackets, “Faith” was dressed up as old-time rock & roll, but the uptight shuffle remains gloriously modern. Michael produced the track himself with micromanaged minimalism. The guitar, claps and drums are so closely microphoned and clipped that the acoustic instruments pop and lock like the best electronic dance music. The hermetically sealed precision of the 1987 title track makes for surprising sexual tension. It’s all audio close-ups, the sonic equivalent of zooming in to a close shot of his tight denim ass.—Brent DiCrescenzo

Download on Amazon

20
“She Drives Me Crazy” by Fine Young Cannibals
“She Drives Me Crazy” by Fine Young Cannibals

Fine Young Cannibals were so much weirder and cooler than you remember. The trio, a splinter off the English Beat, had its roots in ska, but over two albums chiseled a new pop sound that would echo onward from Massive Attack to TV on the Radio. But you could still smash faces at the roller rink to it. The arrangements on the sophomore album, The Raw & the Cooked, are spare and inflated, like punks playing to Wall Street. In this opening cut, big sloppy washes of distorted guitar crashes over a rigid drum machine, as Roland Gift lifts it to the sky with his helium falsetto.—Brent DiCrescenzo

Download on Amazon

21
“Should I Stay or Should I Go” by the Clash
“Should I Stay or Should I Go” by the Clash

As the 1970s turned in the 1980s, punks and rockers (and there was a difference then) both became enamored with the sounds coming out of New York City. Even the Stones went disco and dabbled with rap. No guitar act better assimilated hip-hop than the Clash, probably because they had so much practice sponging up dub. This final single—or the last that matters, anyway—was a dry run for Mick Jones’s sampling-loving crew Big Audio Dynamite, a bit of Isley Brothers meets a Bronx boom box. Jones liked it so much he sampled the track a decade later for “The Globe.”—Brent DiCrescenzo

Download on Amazon

22
“Ain't Nobody” by Chaka Khan
“Ain't Nobody” by Chaka Khan

Penned by Rufus keyboardist David J. "Hawk" Wolinski, this 1983 tune is pure, ecstatic funk. Restrained it ain't—and why would you want it to be? Strap in, as primo belter Chaka Khan harnesses her most primal instincts and delivers a fierce clinic on diva ad libbing.—Andrew Frisicano

Download on Amazon

ADVERTISING

23
“The Sweetest Taboo” by Sade
“The Sweetest Taboo” by Sade

Sade is just so damned smooth. That honeyed voiced, the effortless beauty, it would be easy to be consumed by envy if we weren't all being lulled into a dopey, two-stepping, love-drunk stupor. The Nigerian-born U.K.-raised singer-songwriter is in top form on this hit single from her multi-platinum-selling second album, Promise. When it comes on, you've got no choice but to relax and drift off into the quiet storm.—Kristen Zwicker

Download on Amazon

24
“Love Is a Battlefield” by Pat Benatar
“Love Is a Battlefield” by Pat Benatar

A firm salute, please, for veteran rock chick Pat Benatar, who commanded the airwaves with a take-charge attitude, a spandex wardrobe and the voice to back up both of them. After dropping out of Juilliard and working her way up the ladder at New York nightclubs, she broke out with swaggering songs like “Heartbreaker” and “Hit Me with Your Best Shot,” but 1983’s “Love Is a Battlefield” finds her moving toward a softer-edged epic-pop sound. Some aspects of the production may flirt with kitsch—that spoken-word intro! That whistling in minute four!—but Benatar’s intensity hammers through them to offer a conflicted yet defiant battle-of-the-sexes anthem.—Adam Feldman

Download on Amazon

ADVERTISING

25
"Come on Eileen" by Dexys Midnight Runners
“Come on Eileen” by Dexys Midnight Runners

Maybe not surprising, coming from a band named after an amphetamine, but the U.K. group propels the juddering rhythms of its classic 1982 single like a dynamo, chugging through tempo changes while picking up steam for the big finish. The lyrics, about songwriter Kevin Rowland's youth as a sexually repressed Catholic kid, verge on dirty while remaining innocuous enough for your work-party karaoke sing-along.—Andrew Frisicano

Download on Amazon

26
“Under Pressure” by Queen & David Bowie
“Under Pressure” by Queen & David Bowie

Oh, that ill-fated bassline. Before Vanilla Ice famously ripped off—er, was inspired by the work of Queen bassist John Deacon, that subtle, infectious plucking heralded the meeting of two wildly influential rock icons. Considering the titanic forces at work in this tune, it's relatively understated, but it does ultimately climb to the sparkling heights that both Bowie and Mercury inhabited with such ease.—Kristen Zwicker

Download on Amazon

ADVERTISING

27
“Pour Some Sugar on Me” by Def Leppard
“Pour Some Sugar on Me” by Def Leppard

A sleeper hit for the English heavy-metal band in 1987 (it didn't get much play until the band recorded a promo clip for its North American release), “Pour Some Sugar on Me” is among the group’s finest efforts. The sexual innuendo is awesomely over-the-top (did any teen couple in the '80s not make out to this song?), but in reality the chorus was penned while singer Joe Elliott and his producer were sharing a cup of tea…with sugar. So there's that.—Kate Wertheimer

Download on Amazon

28
“What's Love Got to Do With It” by Tina Turner
“What's Love Got to Do With It” by Tina Turner

In 1984, Tina Turner was 44 years old and on the comeback trail. Having finally split from her brutally abusive husband and artistic Svengali, Ike, she’d spent years in a limbo of cameos, Vegas shows and dud solo albums. But the hit album Private Dancer and its chart-topping single, “What’s Love Got to Do with It”—her first top-10 song in more than a decade—made the tough soul icon a solo superstar. The video found her strutting around New York City in a jean jacket, leather miniskirt and feather-duster hair—a bruised but defiantly happy paragon of independence. The message was clear: Turner’s career still had fabulous legs.—Adam Feldman

Download on Amazon

ADVERTISING

29
“Everywhere” by Fleetwood Mac
“Everywhere” by Fleetwood Mac

Rapture. That’s “Everywhere” in a nutshell. Sung by Christine McVie, this delectable swoon of a song appears on the band’s 1987 album, Tango in the Night (the last disc to date to feature the classic Mac lineup), and it’s the kind of track that needs to be played at least three times in a row, preferably on a roadtrip involving lots of singing along, to reach satisfaction saturation.—Sophie Harris

Download on Amazon

30
“Bizarre Love Triangle” by New Order
“Bizarre Love Triangle” by New Order

Everything in a New Order song is a percussion instrument, from the metronomic drumming to Peter Hook’s bass lines to the synth fills to Bernard Sumner’s rhythmic sigh-singing. That’s why the band will be a dance-floor killer until a comet demolishes us. Each and every element in the song is dancing. By the middle of the decade, the band was mining house music heavily enough to join a union in Chicago though always balancing disco ecstasy with melancholy in true Mancunian fashion. A New Order single is like if architecture was flush with hormones.—Brent DiCrescenzo

Download on Amazon

31
“End of the World as We Know It” by R.E.M
“End of the World as We Know It” by R.E.M

“That’s great, it starts with an earthquake,” begins Michael Stipe—and the rumbling and rambling get crazier from there in R.E.M.’s punk-ironic beat poem. The lyrics pour out in a nervy jumble of apocalyptic imagery, military danger and mass-media frenzy, with pointed name-drops of pop-culture figures (Lenny Bruce, Leonid Brezhnev, Leonard Bernstein and Lester Bangs) united only by their initials. Unlike its evil twin in 1980s rock, Billy Joel’s “We Didn’t Start the Fire,” the song was not a huge pop hit; on its 1987 album, Document, R.E.M. was still emerging from the niche of college rock. But its cut-through-the-chaos message still connects with anyone aiming to clear out a polluted stream of consciousness.—Adam Feldman

Download on Amazon

32
“Blister in the Sun” by Violent Femmes
“Blister in the Sun” by Violent Femmes

Is this song really about that? The opening tune on Milwaukee-buskers-turned-alt-rock-superstars Violent Femmes' self-titled debut starts with one of the more recognizable guitar licks of the modern era, and then proceeds to sing about, um, masturbation—or so everyone thought. That interpretation was disputed by frontman Gordon Gano in an interview with the Village Voice in 2013, but one thing isn't up for debate: "Blister in the Sun" is a catchy, unfettered romp that sounds just as fresh now as it did 30 years ago.—Kristen Zwicker

Download on Amazon

ADVERTISING

33
“Running Up That Hill” by Kate Bush
“Running Up That Hill” by Kate Bush

Bush was discovered when barely into her teens, knocking out genius tunes on a piano in her cozy Kent, England, home. Her erudite songs referenced literature by Emily Brontë and James Joyce, resulting in knotty and outlandish pop music. But her aching sensuality allowed her strangeness to connect with a mass audience. Like Bowie, she was trained in mime, giving her singles a sense of performance and movement, even if you couldn’t see the nifty videos. “Running Up That Hill” was so huge because it was her most digestible—though still weird, with its galloping drums and a Fairlight synthesizer hook that sounds like pan pipes from deep space. Few songs from the era are so rich and perfect.—Brent DiCrescenzo

Download on Amazon

34
“This Charming Man” by the Smiths
“This Charming Man” by the Smiths

Smiths guitarist Johnny Marr was allegedly spurred to write this poppy upbeat single after jealously eyeing the radio success of labelmates Aztec Camera. Whatever the motivation, we're glad he did. Though it didn't top the charts upon release, the 1983 tune became an anthem for the ages, pairing Marr's jangly guitar runs with a delightfully hyperactive bass line and Morrissey's dandified yarn about male affection.—Andrew Frisicano

Download on Amazon

ADVERTISING

35
“I Think We're Alone Now” by Tiffany
“I Think We're Alone Now” by Tiffany

Though this song was first recorded in 1967 by Tommy James and the Shondells, synth-pop songstress Tiffany repopularized the tune in 1987, turning it into a chart-topping teen anthem. A mall tour (remember when that was a thing?), "The Beautiful You: Celebrating the Good Life Shopping Mall Tour '87," solidified both the song's and Tiffany's success, as well as a permanent spot on any best-of-the-'80s list.—Kate Wertheimer

Download on Amazon

36
“Time After Time” by Cyndi Lauper
“Time After Time” by Cyndi Lauper

Those who grew up in the '90s should know this from two awesome movie dance scenes: a sexy one in Baz Luhrmann’s Strictly Ballroom, and a silly one in Romy and Michele’s High School Reunion. But for the '80s crowd, it’s a classic slow dance that stands up as one of the strongest songs of the decade. Cyndi’s mad orange hair might be dated like lukewarm milk, but “Time After Time” still smells fresh to us.—James Manning

Download on Amazon

ADVERTISING

37
 “Down Under” by Men at Work
“Down Under” by Men at Work

This 1981 platinum-certified single is essentially Australia's unofficial national anthem, incorporating country pride, lots of local slang ("fried-out Kombi," "head full of zombie") and even the tune of a popular Aussie children's song, "Kookaburra," for the flute part. Insanely popular in its home country, the song also made waves internationally, shifting millions of copies and becoming an instant karaoke classic. We'll still pass on that Vegemite sandwich though, thanks.—Kate Wertheimer

Download on Amazon

38
"Pictures of You" by the Cure
“Pictures of You” by the Cure

The ’80s were not a time of subtlety. Eye shadow was bright, suits were powerful, and when it came to hair and emotion, bigger was always better. The Cure frontman Robert Smith had both, and wielded the latter to devastating effect in this single from the band’s 1989 masterpiece, Disintegration. Smith’s poignant songwriting was like a post-punk baptism, inviting the lovelorn to let the layers of reverb-laden guitar spill over their heads and wash their pain away.—Kristen Zwicker

Download on Amazon

ADVERTISING

39
"Sweet Child o' Mine" by Guns N' Roses
“Sweet Child o ' Mine” by Guns N' Roses

If you're in an '80s cover band and you're not playing this song on a nightly basis—well, there's just absolutely no way you're not. Of all of the iconic guitar riffs on this list, the opening line from "Sweet Child o' Mine" takes the air-splitting cake. The third single from Guns N' Roses' shining debut, 1987's Appetite for Destruction, it was the band's first and only number one single. Nearly three decades on, it never fails to make us sing our fool hearts out on the dance floor.—Kristen Zwicker

Download on Amazon

Recommended
Film

The best movies out right now
Music

The best jazz shows this month in NYC
Things To Do

The best Women’s History Month events in NYC
Film

The best new movies to see this month
40
“Total Eclipse of the Heart” by Bonnie Tyler
“Total Eclipse of the Heart” by Bonnie Tyler

Nobody writes grandiose heartbreak like Jim Steinman, and he’s never done it better than in this smash 1983 epic ballad for the raspy-voiced Welsh belter Bonnie Tyler. “Total Eclipse of the Heart” was originally conceived as a song for a vampire—it even showed up later in Steinman’s 2002 Broadway fiasco, Dance of the Vampires—and its gothic underpinnings are front and center in the song’s lurid video (which inspired a hilarious YouTube parody). This is longing on a supernatural scale, and Tyler holds her own against the thundering arrangement as she roars out some of the least quiet desperation ever known to pop music.—Adam Feldman

Download on Amazon

41
“In the Air Tonight” by Phil Collins
“In the Air Tonight” by Phil Collins

You'd think that Mike Tyson air-drumming to Phil Collins's 1981 signature hit in The Hangover would've somehow sapped "In the Air Tonight" of its eerie potency. But no, the song, shot through with the Genesis drummer –turned–solo hit maker's post-divorce bitterness, still unfolds with a dramatic tension worthy of Stanley Kubrick, layering haunting guitar wisps, pillowy synth chords and Collins's ghostly vocodered lead turn over a rudimentary Roland CR-78 beat. Oh, and there's also the little matter of the greatest drum fill in pop history at the 3:40 mark.—Hank Shteamer

Download on Amazon

42
“Tainted Love” by Soft Cell
“Tainted Love” by Soft Cell

Turning jaunty Motown influences into icy synth pop may sound like sacrilege, but that's exactly what English duo Soft Cell did when it covered Gloria Jones's 1965 funky stomper in 1981. Ditching the original's energy for Marc Almond's cut-glass tones and unashamedly machine-driven melodies, Soft Cell's version soon became huge, paving the way for the ’80s synth-pop explosion that followed.—Tristan Parker

Download on Amazon

ADVERTISING

43
“Computer Love” by Zapp
“Computer Love” by Zapp

Two decades before T-Pain fell in love with a stripper (and subsequently a bartender) and Kanye West made 808s & Heartbreak, Ohio outfit Zapp’s frontman Roger Troutman was serenading ladies with the aid of Auto-Tune’s weirder, funkier uncle: the talk box. Troutman wasn’t the first to use the mechanism (Peter Frampton, Joe Walsh and Stevie Wonder all preceded him), but he was arguably one of the best. And when the innovative funk man set it against those sparkling synths and ambling drum machine beat, there wasn’t one among us who wasn’t in the mood for a little digital love.—Kristen Zwicker

Download on Amazon

44
“Super Freak” by Rick James
“Super Freak” by Rick James

Catchier than a flytrap, more sordid than a night out with Charlie Sheen, Rick James hit the summit of his career with the wild funk of "Super Freak." A global hit in 1981, the star's signature song finds him joined by the mighty Temptations on backing vocals—including James's uncle, Melvin Franklin. Neither today's changing attitudes toward gender equality nor sampling by MC Hammer can diminish its greatness.—Oliver Keens

Download on Amazon

ADVERTISING

45
“Girl You Know It's True” by Milli Vanilli
“Girl You Know It's True” by Milli Vanilli

It wasn’t just the music that became synthesized in the ’80s: Everything got the imitation treatment. Food manufacturers went on an additives frenzy, everything was made out of plastic, makeup trends made humans look like robots.… So it’s little wonder it turned out that even the pop stars themselves weren’t real, as in the case of German dance-pop duo Milli Vanilli. The pair was rumbled for lip-synching along to “Girl You Know It’s True” in 1989, a year after the song (which celebrates authenticity) was released. Does it make the song any less excellent and era-defining? Absolutely not.—Sophie Harris

Download on Amazon

46
“Push It” by Salt-N-Pepa
“Push It” by Salt-N-Pepa

Complexity, be damned! Sometimes all you really need for a truly memorable hit is economy—as proved by this stone-cold classic from 1988. On "Push It," all-gal Queens hip-hop trio Salt-N-Pepa made pop magic via a seemingly simple combination of Casio beats; a few big, dumb keyboard stabs; and a lot of impassioned, steamy cries of "Ooh, baby baby." Job done.—Tristan Parker

Download on Amazon

ADVERTISING

47
“Back in Black” by ACDC
“Back in Black” by ACDC

A white-hot tribute to late frontman Bon Scott, the title track to AC/DC's seventh studio album has been covered by Muse, Shakira, the Foo Fighters, Santana and countless others. The album, released in 1980, went on to become the second-highest-selling album in history, cementing the Aussie outfit's status as one of the biggest hard rock bands of all time.—Kristen Zwicker

Download on Amazon

48
“Drive” by the Cars
“Drive” by the Cars

Early Cars hits were all tight leather trousers and sunglasses, but by the end of their career, they were producing records like Michael Bay makes movies, filled with special effects, perpetual sunsets and supermodels. “Drive” was their ultimate slow-dance for the end of prom and the template for every Killers song ever. Layers upon layers of keyboards and digital choir boys stack up to make a mille-feuille of gooey, ethereal new-wave.—Brent DiCrescenzo

Download on Amazon

ADVERTISING

49
“Just a Friend” by Biz Markie
“Just a Friend” by Biz Markie

Hip-hop hit its golden era in the ’80s. Biz Markie was both emblematic of the genre’s giddy charms and the man responsible for its ultimate downfall. As critics continued to peg rap as a passing novelty, this big, lisping teddy bear from Long Island thumbed his nose at such stuck-up stupidity. He overtly recycled refuse from pop’s past and amped up the humor, daring haters to resist his charms. His records were as much comedy albums and demonstrations of sampling as pretentious works of art, which made them even greater works of art. Eventually, he had the shit sued out of him, and hip-hop was forever changed. But the greater loss is Biz’s sense of self-deprecation. “Just A Friend” is the opposite of braggadocio.—Brent DiCrescenzo

Download on Amazon

50
“It Takes Two” by Rob Base & DJ EZ Rock
“It Takes Two” by Rob Base & DJ EZ Rock

“I wanna rock right now / I'm Rob Base and I came to get down / I'm not internationally known / But...” If you were born between 1970 and 1985, there's no way you didn't finish that line in your head. Just no possible way. Unless, of course, you're alone right now, in which case you rapped it aloud. This party-igniting flip of Lyn Collins's "Think (About It)" was released in 1988, served as the intro theme to the inaugural season of Yo! MTV Raps, eventually went platinum and still makes us get stupid—we mean outrageous.—Kristen Zwicker

Download on Amazon

51
“What Have You Done for Me Lately” by Janet Jackson
“What Have You Done for Me Lately” by Janet Jackson

You could be forgiven for thinking Janet Jackson appeared as a fully-formed superstar, but in actuality her first two albums were met with mixed reviews and achieved only modest success. All of that changed with "What Have You Done for Me Lately," the lead single from her third effort, Control. With a no-nonsense attitude and some killer dance moves (the video was choreographed by Paula Abdul), Jackson established herself as one of R&B's leading innovators, and a woman who wasn't afraid to demand what she deserved.—Kristen Zwicker

Download on Amazon
